predict_experiment/dataset_result/log/clientnew.log
/root/miniconda3/envs/openrlhf/lib/python3.10/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 11-30 14:31:35 [__init__.py:216] Automatically detected platform cuda.
Namespace(backend='vllm', base_url='http://127.0.0.1:8007', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='custom', dataset_path='/root/predict-schedule/baseline_experiment/pastfuture/dataset/lmsys-50k-filtered', no_stream=False, max_concurrency=64, model='/root/.cache/huggingface/hub/Meta-Llama-3-8B-Instruct', tokenizer=None, use_beam_search=False, num_prompts=500, logprobs=None, request_rate=1.0, burstiness=1.0, seed=42, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=0.8, top_k=20, min_p=None, temperature=0.7, repetition_penalty=1.05, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, maxtokenscustom=8192, m=1, save_output=True, out_path='/root/predict/predict_experiment/dataset_result/benchmarkserving_result', use_custom_csv=False)
加载模型配置成功，模型声明 max_position_embeddings=8192
最终使用 max_pos=8192
加载 HF 本地数据集: /root/predict-schedule/baseline_experiment/pastfuture/dataset/lmsys-50k-filtered
数据集加载成功，样本数: 2600
过滤空 prompt: 2600 -> 2600 条有效记录
过滤长 prompt: 2600 -> 2600 条记录 (阈值=8192)
抽样完成: 500 个样本 (从 2600 条过滤后的样本中抽取)
构建 input_requests 完成：样本 500 条，总请求数 = 500
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 1.0 RPS.
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 500/500 [20:02<00:00,  2.41s/it]
Saved: {'csv': '/root/predict/predict_experiment/dataset_result/benchmarkserving_result_20251130_145141.csv', 'json': '/root/predict/predict_experiment/dataset_result/benchmarkserving_result_20251130_145141.json'}
============ Serving Benchmark Result ============
Successful requests:                     500       
Benchmark duration (s):                  1202.85   
Total input tokens:                      40541     
Total generated tokens:                  1746461   
Min_input_len:                           2.0       
Max_input_len:                           911.0     
Mean_input_len:                          81.082    
P50_input_len:                           29.0      
P99_input_len:                           550.2099999999998
Min_output_len:                          14.0      
Max_output_len:                          8190.0    
Mean_output_len:                         3492.922  
P50_output_len:                          726.0     
P99_output_len:                          8190.0    
Request throughput (req/s):              0.42      
Output token throughput (tok/s):         1451.94   
Total Token throughput (tok/s):          1485.64   
---------------Time to First Token----------------
Mean TTFT (ms):                          111.86    
Median TTFT (ms):                        122.25    
P99 TTFT (ms):                           177.26    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          36.45     
Median TPOT (ms):                        39.64     
P99 TPOT (ms):                           43.78     
---------------Inter-token Latency----------------
Mean ITL (ms):                           37.91     
Median ITL (ms):                         39.71     
P99 ITL (ms):                            81.28     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          132503.60 
Median E2EL (ms):                        24886.32  
P99 E2EL (ms):                           334312.12 
==================================================